{"/about/":{"data":{"":"This is the about page."},"title":"About"},"/docs/":{"data":{"":"","#":"This is the documentation for the admin of a Glympse server.\nGlympse is supplied as a docker container exclusively.\nPrerequisites: docker docker compose Nvidia GPU for transcribing (preferred for transcoding tasks) "},"title":"Server Admin"},"/docs/installation/":{"data":{"":"To install Glympse, you will need a database, a redis cache and a rabbitmq queue all of which must be accessible by all of the Glympse containers you deploy. For that reason it is recommended to keep this as a separate compose file.\nDatabase Install Services Glympse Install "},"title":"Installation"},"/docs/installation/database/":{"data":{"":"To install you will first need the database and queue manager running. Every instance of Glympse you run will need to connect to these containers.\nFirst create your docker network. docker network create glympse_net\nThen create a a directory and compose file:\nmkdir /opt/glympse_database cd /opt/glympse_database nano /opt/glympse_database/compose.yml Paste the following, be sure to change the passwords and any other personal details before saving.\ncompose.ymlservices: redis: image: redis:alpine container_name: redis restart: always ports: - 6379:6379 volumes: - /opt/glympse_database/redis_data:/data healthcheck: test: - CMD - redis-cli - ping interval: 30s timeout: 10s retries: 3 networks: glympse_net: null rabbitmq: image: rabbitmq:3.13.4-management container_name: rabbitmq volumes: - type: bind source: /opt/glympse_database/rabbitmq.conf target: /etc/rabbitmq/conf.d/10-defaults.conf ports: - 15672:15672 - 5672:5672 networks: glympse_net: null mysql: image: mysql:8.0 container_name: mysql environment: MYSQL_ROOT_PASSWORD: \u003croot password\u003e MYSQL_DATABASE: glympse MYSQL_USER: glympse MYSQL_PASSWORD: \u003cglympse password\u003e volumes: - /opt/glympse/mysql:/var/lib/mysql - type: bind source: /opt/glympse_database/my.cnf target: /etc/my.cnf ports: - 6033:6033 - 3306:3306 networks: glympse_net: null networks: glympse_net: external: true There are two more files that you need to create and save before running the compose file.\nFirst is the mysql config file.\nCreate a file called my.cnf in the glympse_database directory: nano my.cnf and paste the following:\nmy.cnf# For advice on how to change settings please see # http://dev.mysql.com/doc/refman/8.0/en/server-configuration-defaults.html [mysqld] # # Remove leading # and set to the amount of RAM for the most important data # cache in MySQL. Start at 70% of total RAM for dedicated server, else 10%. # innodb_buffer_pool_size = 128M # # Remove leading # to turn on a very important data integrity option: logging # changes to the binary log between backups. # log_bin # # Remove leading # to set options mainly useful for reporting servers. # The server defaults are faster for transactions and fast SELECTs. # Adjust sizes as needed, experiment to find the optimal values. # join_buffer_size = 128M # sort_buffer_size = 2M # read_rnd_buffer_size = 2M # Remove leading # to revert to previous value for default_authentication_plugin, # this will increase compatibility with older clients. For background, see: # https://dev.mysql.com/doc/refman/8.0/en/server-system-variables.html#sysvar_default_authentication_plugin # default-authentication-plugin=mysql_native_password skip-host-cache skip-name-resolve datadir=/var/lib/mysql socket=/var/run/mysqld/mysqld.sock secure-file-priv=/var/lib/mysql-files user=mysql connect_timeout = 600 net_read_timeout = 30 wait_timeout = 28800 interactive_timeout = 28800 pid-file=/var/run/mysqld/mysqld.pid [client] socket=/var/run/mysqld/mysqld.sock !includedir /etc/mysql/conf.d/ Finally create a config file for rabbitmq: nano rabbitmq.conf and paste the following:\nbe sure to change the password for something secure and keep note of it as you will need it for your compose env files.\nrabbitmq.confdefault_vhost = glympse default_user = glympse default_pass = \u003center password\u003e default_permissions.configure = .* default_permissions.read = .* default_permissions.write = .* default_user_tags.administrator = true default_user_tags.management = true default_user_tags.glympse = true consumer_timeout = 31622400000 "},"title":"Database Installation"},"/docs/installation/install_glympse/":{"data":{"":"To install glympse we first need to create a docker compose file and then an env file. These two files will allow you to configure most out of the box settings. Once you’re set these up, you will be able to change more setting from the webui.\nServices default to enabled, to disable a service, change yes to no in the environment section of the compose file. To enable a service, either change the environment variable to yes or delete/comment the line.\nUWSGI and NGINX are required for the webui service\nThe following compose file will enable all services in a single container. This will work but it is possible that the transcoding and transcribing tasks can slow down the webui if you’re running on a slower machine.\nIf you are going to be running the transcoder or the transcription engine, you will need an Nvidia GPU. To find the device ID run nvidia_smi on the system you will be installing the container. This will give you an output that looks like this:\n+-----------------------------------------------------------------------------------------+ | NVIDIA-SMI 565.57.02 Driver Version: 566.03 CUDA Version: 12.7 | |-----------------------------------------+------------------------+----------------------+ | GPU Name Persistence-M | Bus-Id Disp.A | Volatile Uncorr. ECC | | Fan Temp Perf Pwr:Usage/Cap | Memory-Usage | GPU-Util Compute M. | | | | MIG M. | |=========================================+========================+======================| | 0 NVIDIA GeForce GTX 1080 On | 00000000:01:00.0 On | N/A | | 27% 38C P8 8W / 180W | 893MiB / 8192MiB | 1% Default | | | | N/A | +-----------------------------------------+------------------------+----------------------+ +-----------------------------------------------------------------------------------------+ | Processes: | | GPU GI CI PID Type Process name GPU Memory | | ID ID Usage | |=========================================================================================| | 0 N/A N/A 26 G /Xwayland N/A | +-----------------------------------------------------------------------------------------+ The device id is in the third row, just above the memory:\n+========================+ | 00000000:01:00.0 On | | 893MiB / 8192MiB | | | +------------------------+ In this case the device id is: 00000000:01:00.0\nAdd this to your compose file. A file that runs all services with a gpu looks like:\ncompose.ymlservices: Glympse_net: image: git.themainframe.co.uk/josh/glympse container_name: Glympse restart: unless-stopped ports: - 8080:80 environment: TZ: Europe/London ENABLE_UWSGI: yes ENABLE_NGINX: yes ENABLE_CELERY_BEAT: yes ENABLE_PROCESSING: yes ENABLE_MIGRATIONS: yes ENABLE_TRANSCRIBER: yes ENABLE_TRANSCODER: yes DJANGO_SETTINGS_MODULE: Glympse.settings.production SECRET_KEY: \"super_secret_key\" SECRET_ADMIN_URL: random_string CSRF_TRUSTED_ORIGINS: http://127.0.0.1 ALLOWED_HOSTS: 127.0.0.1 ADMINS: admin@glympsevideo.com DOMAIN: glympse.glympsevideo.com SQL_ENGINE: django.db.backends.mysql SQL_DATABASE: glympse SQL_USER: glympse SQL_PASSWORD: insecure_password SQL_HOST: mysql SQL_PORT: 3306 EMAIL_HOST: mail.themainframe.co.uk EMAIL_PORT: 587 EMAIL_USE_TLS: true EMAIL_HOST_USER: noreply@glympsevideo.com EMAIL_HOST_PASSWORD: insecure_password DEFAULT_FROM_EMAIL: Glympse\u003cglympse@glympsevideo.com\u003e ALLOWED_EMAIL_DOMAINS: glympsevideo.com REDIS_HOST: redis://redis:6379 RABBITMQ_URL: amqp://glympse:insecure_password@rabbitmq:5672/glympse ADMIN_USERNAME: hub ADMIN_EMAIL: admin@glympsevideo.com ADMIN_PASSWORD: insecure_password LOG_LEVEL: DEBUG TIMEZONE: Europe/London MICROSOFT_AUTH_CLIENT_ID: None MICROSOFT_AUTH_CLIENT_SECRET: None MICROSOFT_AUTH_TENANT_ID: None MEMCACHED: memcached:11211 CUDA_DEVICE: cuda:0 DEBUG: \"True\" REMOTE_WORKER: \"False\" REMOTE_PRODUCTION: None volumes: - /opt/glympse/logs:/Glympse/logs - /media:/media - /rushes:/rushes:ro deploy: resources: reservations: devices: - driver: nvidia device_ids: - 00000000:01:00.0 capabilities: - gpu networks: glympse_net: null memcached: image: memcached:latest container_name: memcached entrypoint: memcached -m 256 restart: unless-stopped networks: glympse_net: null networks: glympse_net: external: true If you are install Glympse on a second system or a system other than where the raw camera files are stored you can use the following to mount the volumes as smb shares:\nvolumes: rushes: driver: local driver_opts: type: cifs o: username=\u003csbm_username\u003e,password=\u003csmb_password\u003e,ro,domain=localhost device: \\\\smb\\share\\path Alternatively you can use a nfs share:\nvolumes: rushes: driver_opts: type: nfs o: \"addr=\u003cnfs-server-ip\u003e,nolock,soft,rw\" device: \":/full/share/path\" You will need to make sure that if you are mounting the raw rushes volume that you mount this as ro or read only so Glympse can not make any changes to the raw rushes.\nIf you are mounting the glympse mediafiles or logs, you will need to mount this as rw or read write so Glympse can create the files."},"title":"Install Glympse"},"/docs/installation/services/":{"data":{"":"Glympse is split into multiple services so you can split the workload between multiple machines.\nThe available services are as follows:\nCelery Beat\nYou should only have one of these running across all your containers. This is responsible for managing the scheduled tasks. Without this, the scheduled tasks will not run. For ease, I usually run this in the same container as the webui.\nWebUI\nThis is the webui front end. The reverse proxy needs to point to the machine that is running this service. It is possible to run more than one frontend for load balancing purposes.\nProcessing\nThis service is responsible for scanning the rushes drives and inserting the rushes into the Glympse database. It is also responsible for other background tasks such as sending emails etc. This worker will run 16 simultaneous tasks.\nTranscoding - Prefers Nvidia GPU\nThis is the transcoding engine. It takes the raw rushes and transcodes them to lower resolution proxy files that can be streamed. The transcoder will try use cuda hardware acceleration but will fall back to software if it is unavailable. This worker will run 4 simultaneous tasks.\nLong Transcoding\nThis was set up to create the thumbnail preview for the video player when you hover over the video play bar to allow for scrubbing. This worker will run 16 simultaneous tasks.\nTranscribing - Requires Nvidia GPU\nThis is responsible for transcribing clips. A modern Nvidia GPU is required for this to work. It is possible to select a different model that may better suit the available hardware. A GPU with more VRAM can support a larger model. This worker will run a single task at a time.\nIt is possible to run one or more services in a single docker container. the running services are managed through the environment settings in the compose file."},"title":"Glympse Services"},"/docs/setup/":{"data":{"":"There are two main ways to change settings for Glympse. The first is the env file, the second is to change some settings from within the application. This can be done whilst the server is up and running from a central point, whereas changes to the env file will need to be replicated on each docker container."},"title":"System Setup"},"/docs/setup/admin_frontend/":{"data":{"":"You can manage most of the admin settings from the front end. When a user is assigned admin permissions or is joined to the “hub” group they will have access to the admin menu on the webUI.","add-production#Add Production":"This brings up the add production modal where you can add a production. This is the same interface as pressing the add production button on the home page.","clear-cache#Clear Cache":"This clears the cache of the system. Useful if there have been large database changes. By default the system caches data for around 10 minutes.\nUsers may have to force refresh their browser to clear their local cache if the changes aren’t appearing for them.","dashboard#Dashboard":"Access the dashboard page. This give you an overview of the system. It will show some figures like how many clips are waiting to be transcoded or how many clips have been transcribed. It also shows you all running tasks and will also show who is currently online.\nYou can also trigger the periodic tasks from the bottom of this page.","edit-production#Edit Production":"Here you can edit productions.\nProduction Admin This is who is responsible for the production. It’s likely that this should be the edit assistant assigned to the production. You can change this here, this person will receive the emails after the production has been scanned.\nCover Image Click the image to upload a new thumbnail image for the production. Or reset it.\nActive An active production will be scanned for new rushes. A deactivated production will still be available to users.\nArchive This will remove the production from being able to be viewed. All files will remain, they will just be hidden.\nExport This will export a json file containing the database entries for this production that can be archived to another system along with the media files. The media files will have to be manually backed up from your server. Once you have backed up the json file and the media, you can delete the production.\nDelete This will delete the production and all the clips associated with it.","logs#Logs":"View the system logs.","manage-users#Manage Users":"Edit Users Select a user from the dropdown menu and you can assign the user to a group. You can also deactivate the user which will keep the account but not allow the user to log in. Or you can delete the user which will delete their account completely.\nIf the user was created by logging in via SSO, they will still be able to log in once they have been deleted. But they will have no permissions and won’t be assigned to a group so will not have access to any productions.\nYou can enable the ability for users to scan or start a production transcoder. They will only be able to scan or transcode the productions they have access to.\nClicking on the number beside their name at the top will enter the impersonation for this user. This is useful if you need to check a user has the correct permissions.\nYou can add a local user by clicking the blue + button at the top.\nEdit Group Permissions When a base production is added, a new group of the same name will be created.\nFrom this page you can select a group and assign productions to it. Users assigned to this group will then be able to access these productions.\nYou can add a new group by clicking the blue + button at the top right.\nFrom this page you can","send-email#Send Email":"Here you can send an email to registered users. Either select an existing email draft or click new to create a new one.\nThis will take you to the editor page. Set the Subject at the top, then select a date and time to send the email. Not setting this will send immediately.\nSelect the recipients of the email and draft the email below.\nThe editor is a WYSIWYG editor so the email body will appear exactly as it does in this editor. You can add images and graphics to the email body should you wish.\nClick save and preview. This will show you a copy of what the email will look like when sent. You will be able to either schedule the send or edit the email again after this point.\nClick Delete to delete the email draft.","settings#Settings":"This will open the django admin setting page."},"title":"Glympse Admin"},"/docs/setup/admin_settings/":{"data":{"":"","authentication-and-authorization#Authentication and Authorization":"","impersonate#Impersonate":"","periodic-tasks#Periodic Tasks.":"The admin settings page is where you can change almost everything. If it’s in the database, it’s likely you can make changes here.\nSystem Settings Whisper ModelSee here for more information\nDefault: small\nSize Parameters English-only model Multilingual model Required VRAM Relative speed tiny 39 M tiny.en tiny ~1 GB ~10x base 74 M base.en base ~1 GB ~7x small 244 M small.en small ~2 GB ~4x medium 769 M medium.en medium ~5 GB ~2x large 1550 M N/A large ~10 GB 1x turbo 809 M N/A turbo ~6 GB ~8x Authentication and Authorization Here you can manage the advanced settings of the users and Groups. Most of these settings can be changed from the front end without coming into the Django Admin page.\nImpersonate Here you can view the logs for the impersonation.\nPeriodic Tasks. These are created when installed. Should you wish to change the time the tasks run, you would do so in the Periodic Tasks section.\nClocked These run once at a specific date and time.\nCron Tabs This is where you can set advanced schedules using cron. See here for more information about Cron\nIntervals These will allow you to let a task run at specific intervals, e.g. run once every hour.\nPeriodic Tasks This is where you register or change the tasks, To change the schedule, you will need to create the schedule using one of the above options and then select it in this page.\nYou can also enable and disable tasks here as well as override the priority of the task.","review#Review":"Review Files This is where you can see all the files that have been uploaded for review. You can retranscode or delete the files from here.\nShare Links Add, edit or delete the share links for files here.","rushes-management#Rushes Management":"You can make changes to the metadata of the clips or add or remove the productions here. But most of these tasks can and should be done in the front end.\nBase Productions Add or edit the base productions. You can also change the group that the Base Production is assigned to.\nProduction Here you can make changes to the production such as the name, friendly name, filepath etc. You can also trigger some tasks from this page such as the file scan or the transcoder.\nclips Here you can see and edit all the metadata for the clips in the Glympse database.","system-settings#System Settings":"","transcribe#Transcribe":"Clips for Transcription Here you can see all of the clips that have been sent to the transcription engine. You can trigger tasks such as re-transcribe or delete the files from here.","whisper-model#Whisper Model":""},"title":"Django Admin Settings"},"/user_docs/":{"data":{"":"Welcome to the user documentation of Glympse.\nGlympse is designed to be as intuitive as possible, so hopefully you won’t need to read this but its here if you need."},"title":"User Documentation"},"/user_docs/edit_metadata/":{"data":{"":"It is possible to edit some of the metadata for the clips within Glympse.\nAny metadata changes apply only to the Glympse database and are not carried over to the clips themselves.\nTo edit the metadata of the clips, click “Edit Clips” in the top right. This will look like the home page where you can select your production. Click the Edit button to edit the clip metadata."},"title":"Metadata"},"/user_docs/edit_metadata/editing_metadata/":{"data":{"":"When you click Edit on the metadata page you will be taken to the edit page. This shows a table with all the clips for that production. You can see whether a clip has been transcoded, is marked as hidden or edit the metadata of the clip(s)\nThere are limited options for editing the metadata. You can edit only the roll, the date and the shooter aswell as hide or unhide a clip.\nTo edit a clip select it by checking the checkbox of the clip row. At the bottom of the table you can enter a new roll/date/shooter then click save to save the edits.\nWhatever you entered in all three boxes will be applied to the selected clips. Leave the box empty to leave the current details unchanged.\nYou can also hide/unhide clips by checking the hide checkbox. As soon as you click the checkbox it will be immediately hidden. It is possible that the clips may still appear until the cache has ben flushed. This process can take 10-15 minutes.\nFrom this page you can also send multiple clips to the transcription engine.\nSelect the clips by checking the checkbox and click transcribe. This w3ill send the selected clips to be transcribed.\nYou can also delete clips from the Glympse database.\nGlympse has read only access to the raw camera files, by deleting clips from Glympse, the original camera files will be unaffected."},"title":"Editing Metadata"},"/user_docs/review/":{"data":{"":"Glympse has the ability to upload files for review and approval. Once you upload a file to Glympse, you can add markers and send the file to people within your team using and internal link or to anyone using the create link function."},"title":"Review"},"/user_docs/review/upload_and_manage_files/":{"data":{"":"","upload#Upload":"Upload To upload a file, navigate to the review section of Glympse and click upload in the top right. "},"title":"Upload and Manage Files"},"/user_docs/watching-clips/":{"data":{"":" Once You have been added to a production(s). You will see all your available productions on your home page. Under the thumbnail for each production you will see a list of buttons. The fist will let you view all the rushes from every shooter.\nUnder that you will see a list of the shooters from that project. Clicking on these will allow you to filter the production by that shooter.\nIf we were to click on John Snow from either the home page or at the top of the rushes page. We will filter the rushes to show only those shot by John Snow.\nAt the top of the page, you can also click on the name of the shooter to filter the clips. Clicking on the shooter will only return results shot by the selected shooter. Clicking All or Reset will show all the rushes again.\nIn the search bar, you can search for a card or date. The results will be filtered live as you type.\nOnce you select a card, you’ll be taken to the video player screen."},"title":"Watching Clips"},"/user_docs/watching-clips/add_production/":{"data":{"":"To add a production click the “Add Production” button in the top right of the home page.\nThis will bring up the dialogue to add a new production. A production consists of two parts. The Base Production and the Production.\nFor example your Base Production may be “Game of Thrones” then the Production could be “Game of Thrones Series 1”","base-production#Base Production":"Select the Base Production, if it doesn’t exist create it by clicking the button next to the select dropdown. Enter the new name of your production and click submit. The name you entered will be automatically selected.","friendly-name#Friendly Name":"Enter a short friendly name for the series. This is what will appear on the default thumbnail. In this example we will enter GOTS1","priority#Priority":"Most productions can be left as the default of 20. But if you have a smaller production or one where the transcodes need to be run before others you can change the priority here. 0 = lowest priority 100 = highest priority.","production-owner#Production Owner":"This is who will be responsible for the production. They will get the emails to say that the production has been scanned etc. This will usually be the edit assistant assigned to the project. The user must exist in the Glympse system.\nIf left empty, this will default to the admin user.\nClick submit and the production will be added to Glympse and the Processing engine will start scanning for new clips. ","production-series#Production Series":"Enter the series of the production you are adding. This must be an integer.","select-the-location-of-the-camera-rushes#Select the location of the camera rushes.":"Click on a directory to open it and select it by clicking the radio check mark on the left. "},"title":"Adding A Production"},"/user_docs/watching-clips/user_settings/":{"data":{"":"From the User Settings menu you can change some personal settings. ","auto-addremove-tags#Auto Add/Remove Tags":"When checked, this will automatically add or remove tags on any related clips. When unchecked this, any tags you add or remove, will only be apply to the clips you have selected.","auto-expand-related-clips#Auto Expand related clips":"This will automatically expand the related clips accordion oin the right next to the player. If it is enabled, the related clips will be shown automatically. If disabled you would need to manually open the accordion to display them.","marker-colour#Marker Colour":"Change the colour of your markers, this only really applies to the Review section.","receive-admin-emails#Receive Admin Emails":"If you are set as a production owner, this enables/disables the email updates.","reset-timecode-position#Reset Timecode Position":"It is possible that the timecode box may disappear off the ege of the video player. Especially if you use multiple devices with different resolution screens. If that happens, you can reset it to the top left corner here.","show-timecode-heading#Show Timecode Heading":"This enables/disables the timecode box in the video player. Is is enabled by default, should you wish to disable it, you would do so here.","timecode-size#Timecode Size":"Default: 16\nYou can change the font size for the timecode box here. Increase to make the timecode larger, decrease to make it smaller."},"title":"User Settings"},"/user_docs/watching-clips/watch/":{"data":{"":"","#":" This is where you will watch through the clips in Glympse.\nWhen the page loads, it will automatically load the first clip into the player. To start playing you can press the big play button in the centre.\nThe video Player Timecode Glympse uses the timecode from the media files. This is so that it matches the timecode that your editor sees within Avid or their NLE of choice.\nIt is possible that the timecode in Glympse may be a frame off, this is because the timecodes must be calculated rather than read from the file. It will never be more that one frame off the timecode in the NLE.\nThe timecode of the clip is displayed in two places. The seek bar: And there is a timecode box in the top left: This timecode box can be moved anywhere in the player window by dragging it to where you’d like it to be. You can reset the position of the timecode or disable the timecode box using the user settings menu.\nAudio Selection For clips that have more than one track of audio, you can select the track to play back by clicking on the headphone icon on the playbar and selecting the audio track. Glympse by default creates a full mix of all the audio channels and plays this by default. Theatre Mode Clicking the theatre mode button will expand the player to take 100% the width of the browser window. Clicking the theatre mode button again will return the player back to its normal size.\nFull Screen Click this button for full screen playback Rotate Some clips like GoPro files can be the wrong orientation. Click the rotate button to rotate the clip by 180° Click the restore rotate to return the clip to its original orientation. Keyboard shortcuts When on this page there are a number of keyboard shortcuts you can use. J, K, L are shuttle controls to speed up or change the direction of play. You may have to click in the player window to enable these controls. Holding the Shift Key will also increase the amount the play is sped up or slowed down.\nM will add a marker at the current time of the clip. Markers will appear for everyone who has access to the production.\nSelecting Clips You can select the clip you’d like to view from the table at the bottom of the screen. Click the title of the clip to load it into the player.\nYou can also navigate through the clips by pressing the Next/Prev buttons at the bottom of the player. This will load the next or previous clip.\nThe title of the currently playing clip is shown at the bottom of the player and the middle of the menu bar at the top.\nRelated Clips When clips are loaded into Glympse, the system will scan for the start timecode and the end timecode of a clip. This allows it to show all the related clips of the clip you are playing. The related clips box onthe right of the player will update whenever the source of the video player changes. You can automatically hide or show the related clips dropdown using the user settings menu.\nIn this example the clip being played belongs to the Main camera and there are two GoPro cameras that have clips with overlapping timecodes.\nClicking on the title of these related clips will play it in the current page, allowing you to quickly view clips from the other cameras. When you’re viewing a related clip, the title in the menu bar and below the player will change showing you that it’s playing a related clip then it will list the card followed by the clip title. As well as this, the prev/next buttons will disappear from below the player. You can select the next related clip by clicking on the clip title or you can return to the original clip by selecting it in the table at the bottom again. This will re-enable the next prev buttons and you can resume watching the camera clips as normal.\nYou can also navigate to any related cards from the related menu in the manu bar. This will show you camera cards from the same camera operator shot on the same day.\nMarkers and Tags You can add markers or tags to any clip within Glympse.\nMarkers Markers allow you to mark a specific place in a clip. They will be displayed in the marker window next to the player and clicking on them will take you to the correct position in the clip.\nMarkers are shown to everyone who has access to the clip.\nTags Tags are to tag an entire clip. You can tag more than one clip at a time. There is also a setting in the user settings menu that will automatically add the tags to any related clips.\nTags are available to everyone who has access to the clips.","menu-bar#Menu Bar":" The menu bar may show different options depending on what permissions you have. For example, the Download button will only appear if you have been give download permission for your production.\nFile From the file menu you can send a clip to be transcribed, edit the metadata of the card, submit the card for re-transcode or report issues with the card.\nTranscribe Select the clip or clips you would like to transcribe by checking the box in the table and click file then transcribe. This will send the selected clip(s) to the transcription engine. You can learn more about how this works here.\nEdit metadata From this menu you can change some of the metadata for the card. Anything you change here will be applied to every clip in the card.\nYou can change the date, the card name, or the shooter. You can also hide the card which will stop it from showing on the rushes page. Anyone with a link to the card would still be able to access the clips. This will only stop the card from appearing in the rushes page. Users with access to the production can also unhide any card from the metadata edit pages.\nRequest Retranscode This will send the entire card back through the transcode engine. It allows you to report any issues with the card and manually submit the clips to the transcoder. The transcode will only work if the original clips are still available.\nReport Issues This allows you to report issues with the current card. But this option will not automatically retranscode the clips. They would need to be manually transcoded by the admin team.\nRelated This will show any cards that were shot by the same camera operator on the same day as the current card. Clicking one of these will take you load that current card.\nDownload If you have been given the download permissions for your production, you can download the original clip by selecting the clips from the table with the checkbox and clicking download. These files can be very large and may take a long time to download.\nHelp This will open these help pages.\nSettings This will open the user settings menu. Click here to learn more.\nIn the centre of the menu bar, the title of the currently loaded clip will be displayed."},"title":"Watching clips"}}